/* Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить 
строку с наименьшей суммой элементов.
Например, задан массив:

1 4 7 2
5 9 2 3
8 4 2 4
5 2 6 7

Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей 
суммой элементов: 1 строка
*/

// функции
int[,] CreateBaseArray(int str = 4, int col = 5)
{
    int[,] array = new int[str, col];
    Random rnd = new Random();
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = rnd.Next(0, 10);
        }
    }
    return array;
}
void PrintArray(int[,] array, string msg)
{
    Console.WriteLine(msg);
    for (int i = 0; i < array.GetLength(0); i++)
    {
        Console.WriteLine();
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write(array[i, j] + " ");
        }
    }
    Console.WriteLine();
}
int MinSumStrBaseArray(int[,] array)  // нахождение строки с минимальной суммой элементов
{
    int index = 0, minsum = 0;
    for (int i = 0; i < array.GetLength(0); i++)
    {
        int sum = 0;
        for (int j = 0; j < array.GetLength(1); j++)
        {
            sum += array[i, j];
        }
        Console.WriteLine($"Сумма элементов {i + 1} строки = {sum}");
        if (i == 0)
        {
            minsum = sum;
        }
        else if (sum < minsum)
        {
            minsum = sum;
            index = i;
        }
    }
    return index;
}

//Создаем двумерный массив
int[,] baseArray = CreateBaseArray();
// выводим двумерный массив
PrintArray(baseArray, "Базовый массив: ");
// находим номер строки с минимальной суммой элементов
int StrMinSum = MinSumStrBaseArray(baseArray);
Console.WriteLine($"Строка с минимальной суммой элементов {StrMinSum + 1}.");








